backend/app/controllers/authentication_controller.rb

    def signup
      user = User.new(user_params)

      if user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ('testuser', 'test@example.com', '$2a$12$1tzdlbjoDZ8GCUtXNO32VuSBnR3ktpFrLhhNsUfNuHPcBtIjdnMpm', '2024-12-24 20:20:48.306214', '2024-12-24 20:20:48.306214') RETURNING "id"

    def login
      user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'test@example.com' LIMIT 1